DebtManagment/src/Documents/Платеж/Платеж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Платеж</name>
  <registerRecords>AccumulationRegister.ОстаткиДолгов</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Долги</name>
    <attributes>
      <name>Плательщик</name>
      <type>
        <types>CatalogRef.Должники</types>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DebtManagment/src/Documents/Платеж/Forms/ФормаДокументаОднострочная/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика  ,
//	СтуруктураЗаполнения=Новый Структура;
	Если ЗначениеЗаполнено(Параметры.Ключ) тогда 
		Если Параметры.Ключ.Долги.Количество()>0 тогда
		СтрокаПлатежа=Параметры.Ключ.Долги[0];
		ДатаПлатежа =СтрокаПлатежа.ДатаПлатежа;
		Долг =СтрокаПлатежа.Долг;
		Плательщик =СтрокаПлатежа.Плательщик;
        СуммаПлатежа =СтрокаПлатежа.СуммаПлатежа;
		Комментарий = СтрокаПлатежа.Комментарий;
		КонецЕсли;
	иначе 
		ДатаПлатежа =Параметры.ДатаПлатежа;
	Долг =Параметры.Долг;
	Плательщик =Параметры.Плательщик;
	
	КонецЕсли;	
//	ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика  
КонецПроцедуры   

&НаСервере
Функция ВернутьСтрокуПлатежа(Документ)
	Если Документ.Долги.Количество()=0 тогда
		Возврат Документ.Долги.Добавить();
	иначе                        
		Возврат Документ.Долги[0];
	КонецЕсли;	
КонецФункции	

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика 
		СтрокаДолги=ВернутьСтрокуПлатежа(ТекущийОбъект);
	СтрокаДолги.Плательщик=Плательщик;
	СтрокаДолги.Долг = Долг;
	СтрокаДолги.СуммаПлатежа =СуммаПлатежа;
	СтрокаДолги.ДатаПлатежа =ДатаПлатежа;	
	СтрокаДолги.Комментарий =Комментарий;

КонецПроцедуры
